from collections import namedtuple


from pprint import pprint
import re
w =[
    (4, 68, '5.2', 'сборник', 'Автоматизированные системы управления', '5', 2, 3),
    (5, 68, '5.3', 'сборник', 'Системы вентиляции и кондиционирования воздуха', '5', 2, 3),
    (3, 68, '5.1', 'сборник', 'Электротехнические устройства', '5', 2, 3),
    (8, 68, '5.7', 'сборник', 'Теплоэнергетическое оборудование', '5', 2, 3),
    (9, 68, '5.9', 'сборник', 'Сооружения водоснабжения и канализации', '5', 2, 3),
    (10, 68, '5.10', 'сборник', 'Сборник укрупненных показателей стоимости пусконаладочных работ', '5', 2, 3),
    (11, 68, '5.11', 'сборник', 'Экологическое сопровождение объектов строительства и...', '5', 2, 3),
    (6, 68, '5.4', 'сборник', 'Подъемно-транспортное оборудование', '5', 2, 3),
    (7, 68, '5.6', 'сборник', 'Холодильные и компрессорные устройства', '5', 2, 3),
]


x = ['5.1-3-1-0-19', '5.1-3-1-0-20', '5.1-3-1-0-21', '5.1-3-3-0-29', '5.1-3-3-0-30', '5.1-3-3-0-31',
     '5.1-3-3-0-32', '5.1-4-1-0-37', '5.1-4-1-0-38', '5.1-4-1-0-39', '4.1-4-5'
     ]
y = ['5.1', '5.10', '5.11', '5.2', '5.3', '5.4', '5.6', '5.7', '5.9']


def split_code_int(src_code: str):
    """ Разбивает шифр на части из чисел. '4.1-2-10' -> (4, 1, 2, 10)"""
    return tuple(map(int, re.split('[.-]', src_code))) if src_code else tuple()

# print(split_code_int('4.1-2-10'))
# print(split_code_int(''))
# t = [split_code_int(x) for x in y]
# print(y)
# y.sort()
# print(y)
# x.sort(key=split_code_int)
# print(x)

# w.sort(key=lambda x: split_code_int(x[2]))
# pprint(w, width=350)

print(w[0], len(w[0]))
item = namedtuple("item", "ID period code item description raw_parent ID_parent FK")
v = item._make(w[0])
print(v)
print(v.description)
